{"response":{"status":"ok","userTier":"developer","total":1,"content":{"id":"world/2017/apr/16/home-secretary-urged-revoke-asma-al-assad-british-citizenship","type":"article","sectionId":"world","sectionName":"World news","webPublicationDate":"2017-04-16T17:18:31Z","webTitle":"Home secretary urged to revoke Asma al-Assad's British citizenship","webUrl":"https://www.theguardian.com/world/2017/apr/16/home-secretary-urged-revoke-asma-al-assad-british-citizenship","apiUrl":"https://content.guardianapis.com/world/2017/apr/16/home-secretary-urged-revoke-asma-al-assad-british-citizenship","blocks":{"body":[{"id":"58f3780ee4b0e0ec04f01759","bodyHtml":"<p>The home secretary has been urged to consider revoking the British passport of Asma al-Assad, the UK-born wife of the Syrian president, Bashar al-Assad, after her social media posts in support of his regime.</p> <p>Led by their foreign affairs spokesman, Tom Brake, the Liberal Democrats have written to Amber Rudd calling on her to use her powers to withdraw Asma Assad’s citizenship.</p> <p>Brake said: “The first lady of Syria has acted not as a private citizen but as a spokesperson for the Syrian presidency ... Boris Johnson has urged other countries to do more about Syria, but the British government could say to Asma Assad, either stop using your position to defend barbaric acts, or be stripped of your citizenship.”</p> <p>The Tory MP Nadhim Zahawi backed the call, saying she was “very much part of the propaganda machine that is committing war crimes”.</p> <p>She has used social media to support her husband’s presidency after the global condemnation of his alleged role in a <a href=\"https://www.theguardian.com/world/2017/apr/04/syria-chemical-attack-idlib-province\">chemical weapons attack on civilians</a>.</p> <p>After t<a href=\"https://www.theguardian.com/world/2017/apr/06/trump-syria-missiles-assad-chemical-weapons\">he US counterstrike on the regime</a>, a message was posted on one of her accounts saying: “The presidency of the Syrian Arab Republic affirms that what America has done is an irresponsible act that only reflects a shortsightedness, a narrow horizon, a political and military blindness to reality and a naive pursuit of a frenzied false propaganda campaign.”</p> <p>Asma Assad was was educated in Britain and worked as an investment banker before she married in 2000. Withdrawing her passport would not leave her stateless, however, because she is thought to be a dual British-Syrian national.</p>","bodyTextSummary":"The home secretary has been urged to consider revoking the British passport of Asma al-Assad, the UK-born wife of the Syrian president, Bashar al-Assad, after her social media posts in support of his regime. Led by their foreign affairs spokesman, Tom Brake, the Liberal Democrats have written to Amber Rudd calling on her to use her powers to withdraw Asma Assad’s citizenship. Brake said: “The first lady of Syria has acted not as a private citizen but as a spokesperson for the Syrian presidency ... Boris Johnson has urged other countries to do more about Syria, but the British government could say to Asma Assad, either stop using your position to defend barbaric acts, or be stripped of your citizenship.” The Tory MP Nadhim Zahawi backed the call, saying she was “very much part of the propaganda machine that is committing war crimes”. She has used social media to support her husband’s presidency after the global condemnation of his alleged role in a chemical weapons attack on civilians. After the US counterstrike on the regime, a message was posted on one of her accounts saying: “The presidency of the Syrian Arab Republic affirms that what America has done is an irresponsible act that only reflects a shortsightedness, a narrow horizon, a political and military blindness to reality and a naive pursuit of a frenzied false propaganda campaign.” Asma Assad was was educated in Britain and worked as an investment banker before she married in 2000. Withdrawing her passport would not leave her stateless, however, because she is thought to be a dual British-Syrian national.","attributes":{},"published":true,"createdDate":"2017-04-16T13:56:30Z","firstPublishedDate":"2017-04-16T15:42:18Z","publishedDate":"2017-04-16T17:29:52Z","lastModifiedDate":"2017-04-16T17:29:51Z","contributors":[],"elements":[{"type":"text","assets":[],"textTypeData":{"html":"<p>The home secretary has been urged to consider revoking the British passport of Asma al-Assad, the UK-born wife of the Syrian president, Bashar al-Assad, after her social media posts in support of his regime.</p> \n<p>Led by their foreign affairs spokesman, Tom Brake, the Liberal Democrats have written to Amber Rudd calling on her to use her powers to withdraw Asma Assad’s citizenship.</p> \n<p>Brake said: “The first lady of Syria has acted not as a private citizen but as a spokesperson for the Syrian presidency ... Boris Johnson has urged other countries to do more about Syria, but the British government could say to Asma Assad, either stop using your position to defend barbaric acts, or be stripped of your citizenship.”</p> \n<p>The Tory MP Nadhim Zahawi backed the call, saying she was “very much part of the propaganda machine that is committing war crimes”.</p> \n<p>She has used social media to support her husband’s presidency after the global condemnation of his alleged role in a <a href=\"https://www.theguardian.com/world/2017/apr/04/syria-chemical-attack-idlib-province\">chemical weapons attack on civilians</a>.</p> \n<p>After t<a href=\"https://www.theguardian.com/world/2017/apr/06/trump-syria-missiles-assad-chemical-weapons\">he US counterstrike on the regime</a>, a message was posted on one of her accounts saying: “The presidency of the Syrian Arab Republic affirms that what America has done is an irresponsible act that only reflects a shortsightedness, a narrow horizon, a political and military blindness to reality and a naive pursuit of a frenzied false propaganda campaign.”</p> \n<p>Asma Assad was was educated in Britain and worked as an investment banker before she married in 2000. Withdrawing her passport would not leave her stateless, however, because she is thought to be a dual British-Syrian national.</p>"}}]}],"totalBodyBlocks":1},"isHosted":false,"pillarId":"pillar/news","pillarName":"News"}}}