{"response":{"status":"ok","userTier":"developer","total":1,"content":{"id":"world/2017/apr/16/iran-hassan-rouhani-face-tough-re-election-race-as-candidate-list-closes","type":"article","sectionId":"world","sectionName":"World news","webPublicationDate":"2017-04-16T16:06:09Z","webTitle":"Hassan Rouhani faces tough re-election race as candidate list closes","webUrl":"https://www.theguardian.com/world/2017/apr/16/iran-hassan-rouhani-face-tough-re-election-race-as-candidate-list-closes","apiUrl":"https://content.guardianapis.com/world/2017/apr/16/iran-hassan-rouhani-face-tough-re-election-race-as-candidate-list-closes","blocks":{"body":[{"id":"58f33f96e4b05776df18e218","bodyHtml":"<p>Hassan Rouhani, Iran’s moderate president who is seeking re-election, faces a boisterous race after heavyweight conservative figures critical of his landmark nuclear agreement with the west put themselves up to challenge him.</p> <p>Registration for candidates in Iran’s presidential elections next month ended on Saturday, with a record number of 1,636 people putting their names on the list, including 137 women. On Friday, Rouhani took his ID card, a few passport-sized photos and other paperwork to the interior ministry in Tehran’s Fatemi Street to register to run for a second term. His four predecessors have all served two conservative terms.</p> <aside class=\"element element-rich-link element--thumbnail\"> <p> <span>Related: </span><a href=\"https://www.theguardian.com/world/2017/apr/12/iran-mahmoud-ahmadinejad-run-president-election-despite-khamenei-warning\">Iran's Ahmadinejad to run for president despite Khamenei warning</a> </p> </aside>  <p>Ebrahim Raisi, a close ally of the country’s supreme leader, Ayatollah Ali Khamenei, <a href=\"https://www.theguardian.com/world/2017/apr/09/conservative-cleric-ebrahim-raisi-enters-irans-presidential-race\">whose bid for presidency has upended the race</a>, also registered on Friday. The former hardline president Mahmoud Ahmadinejad and Tehran’s mayor, Mohammad-Bagher Ghalibaf, are among a handful of other serious candidates running.</p> <p>The list of presidential hopefuls has been sent to the guardian council, a powerful body of jurists and clerics, which began a five-day vetting process on Sunday. A limited number of candidates are usually allowed through. Critics say the council has arbitrarily blocked many high-profile politicians in recent years, going beyond its constitutional responsibilities. </p> <p>This year, all eyes are on the council to see if it will approve Ahmadinejad, who registered <a href=\"https://www.theguardian.com/world/2017/apr/12/iran-mahmoud-ahmadinejad-run-president-election-despite-khamenei-warning\">despite advice by Khamenei not to</a>. The campaign period starts on 28 April and ends one day before the vote, which is scheduled for 19 May.</p> <p>Ali Ansari, a professor of Iranian history at the University of St Andrews, said Raisi’s surprising decision to run has been “the fly in the ointment” in what could have been a relatively straightforward, albeit challenging, race for Rouhani to win a second term. Raisi’s rise to prominence over the past year has intrigued many commentators who speculate that he is being touted as a frontrunner to succeed Khamenei, a higher position than that of the president. </p> <aside class=\"element element-rich-link element--thumbnail\"> <p> <span>Related: </span><a href=\"https://www.theguardian.com/world/2017/apr/09/conservative-cleric-ebrahim-raisi-enters-irans-presidential-race\">Conservative cleric Ebrahim Raisi enters Iran's presidential race</a> </p> </aside>  <p>“I think definitely it has complicated the race,” Ansari said. “I think the fact that Raisi is coming, unless he steps aside, it looks very unlikely to me that the <em>nezam</em> [ruling system] would allow Raisi to be humiliated in an election. He hasn’t come to lose. He is an up-and-coming player in the system and in the last six months he’s basically come from nowhere.” </p> <p>There are also concerns about Rouhani’s possible disqualification. That explains why his first deputy, Eshaq Jahangiri, a figure close to the reformists, also registered to run on Saturday. “I’m here to supplement Rouhani,” he said, meaning that his bid for the presidency was tactical and that he would drop out if Rouhani is allowed to run.</p> <p>“Rouhani is not in as strong a position as we think he is, because he delivered the JCPOA [nuclear deal]. JCPOA in Iran is not seen as a giant triumph, and for me the problem is the way Rouhani sold it,” Ansari said. <br></p> <p>“He has stablised the economy, but I think he made a number of very exaggerated claims, and he is now paying the price in the popular mood. But in an open election I think people would vote for Rouhani . Rouhani is the best of a bad choice, but at the same time I don’t think he’s as clear a winner as some people in the west would like to think.”</p> <p>Although women have registered, all female nominees have previously been blocked from running. Azam Talaghani, a former MP and the daughter of a prominent revolutionary ayatollah, is among the women who have put their names on the list to test whether the authorities would allow women to run.</p>","bodyTextSummary":"Hassan Rouhani, Iran’s moderate president who is seeking re-election, faces a boisterous race after heavyweight conservative figures critical of his landmark nuclear agreement with the west put themselves up to challenge him. Registration for candidates in Iran’s presidential elections next month ended on Saturday, with a record number of 1,636 people putting their names on the list, including 137 women. On Friday, Rouhani took his ID card, a few passport-sized photos and other paperwork to the interior ministry in Tehran’s Fatemi Street to register to run for a second term. His four predecessors have all served two conservative terms.\nEbrahim Raisi, a close ally of the country’s supreme leader, Ayatollah Ali Khamenei, whose bid for presidency has upended the race, also registered on Friday. The former hardline president Mahmoud Ahmadinejad and Tehran’s mayor, Mohammad-Bagher Ghalibaf, are among a handful of other serious candidates running. The list of presidential hopefuls has been sent to the guardian council, a powerful body of jurists and clerics, which began a five-day vetting process on Sunday. A limited number of candidates are usually allowed through. Critics say the council has arbitrarily blocked many high-profile politicians in recent years, going beyond its constitutional responsibilities. This year, all eyes are on the council to see if it will approve Ahmadinejad, who registered despite advice by Khamenei not to. The campaign period starts on 28 April and ends one day before the vote, which is scheduled for 19 May. Ali Ansari, a professor of Iranian history at the University of St Andrews, said Raisi’s surprising decision to run has been “the fly in the ointment” in what could have been a relatively straightforward, albeit challenging, race for Rouhani to win a second term. Raisi’s rise to prominence over the past year has intrigued many commentators who speculate that he is being touted as a frontrunner to succeed Khamenei, a higher position than that of the president.\n“I think definitely it has complicated the race,” Ansari said. “I think the fact that Raisi is coming, unless he steps aside, it looks very unlikely to me that the nezam [ruling system] would allow Raisi to be humiliated in an election. He hasn’t come to lose. He is an up-and-coming player in the system and in the last six months he’s basically come from nowhere.” There are also concerns about Rouhani’s possible disqualification. That explains why his first deputy, Eshaq Jahangiri, a figure close to the reformists, also registered to run on Saturday. “I’m here to supplement Rouhani,” he said, meaning that his bid for the presidency was tactical and that he would drop out if Rouhani is allowed to run. “Rouhani is not in as strong a position as we think he is, because he delivered the JCPOA [nuclear deal]. JCPOA in Iran is not seen as a giant triumph, and for me the problem is the way Rouhani sold it,” Ansari said. “He has stablised the economy, but I think he made a number of very exaggerated claims, and he is now paying the price in the popular mood. But in an open election I think people would vote for Rouhani . Rouhani is the best of a bad choice, but at the same time I don’t think he’s as clear a winner as some people in the west would like to think.” Although women have registered, all female nominees have previously been blocked from running. Azam Talaghani, a former MP and the daughter of a prominent revolutionary ayatollah, is among the women who have put their names on the list to test whether the authorities would allow women to run.","attributes":{},"published":true,"createdDate":"2017-04-16T09:55:34Z","firstPublishedDate":"2017-04-16T09:55:59Z","publishedDate":"2017-04-16T23:29:06Z","lastModifiedDate":"2017-04-16T23:29:06Z","contributors":[],"elements":[{"type":"text","assets":[],"textTypeData":{"html":"<p>Hassan Rouhani, Iran’s moderate president who is seeking re-election, faces a boisterous race after heavyweight conservative figures critical of his landmark nuclear agreement with the west put themselves up to challenge him.</p> \n<p>Registration for candidates in Iran’s presidential elections next month ended on Saturday, with a record number of 1,636 people putting their names on the list, including 137 women. On Friday, Rouhani took his ID card, a few passport-sized photos and other paperwork to the interior ministry in Tehran’s Fatemi Street to register to run for a second term. His four predecessors have all served two conservative terms.</p>"}},{"type":"rich-link","assets":[],"richLinkTypeData":{"url":"https://www.theguardian.com/world/2017/apr/12/iran-mahmoud-ahmadinejad-run-president-election-despite-khamenei-warning","originalUrl":"https://www.theguardian.com/world/2017/apr/12/iran-mahmoud-ahmadinejad-run-president-election-despite-khamenei-warning","linkText":"Iran's Ahmadinejad to run for president despite Khamenei warning","linkPrefix":"Related: ","role":"thumbnail"}},{"type":"text","assets":[],"textTypeData":{"html":"<p>Ebrahim Raisi, a close ally of the country’s supreme leader, Ayatollah Ali Khamenei, <a href=\"https://www.theguardian.com/world/2017/apr/09/conservative-cleric-ebrahim-raisi-enters-irans-presidential-race\">whose bid for presidency has upended the race</a>, also registered on Friday. The former hardline president Mahmoud Ahmadinejad and Tehran’s mayor, Mohammad-Bagher Ghalibaf, are among a handful of other serious candidates running.</p> \n<p>The list of presidential hopefuls has been sent to the guardian council, a powerful body of jurists and clerics, which began a five-day vetting process on Sunday. A limited number of candidates are usually allowed through. Critics say the council has arbitrarily blocked many high-profile politicians in recent years, going beyond its constitutional responsibilities. </p> \n<p>This year, all eyes are on the council to see if it will approve Ahmadinejad, who registered <a href=\"https://www.theguardian.com/world/2017/apr/12/iran-mahmoud-ahmadinejad-run-president-election-despite-khamenei-warning\">despite advice by Khamenei not to</a>. The campaign period starts on 28 April and ends one day before the vote, which is scheduled for 19 May.</p> \n<p>Ali Ansari, a professor of Iranian history at the University of St Andrews, said Raisi’s surprising decision to run has been “the fly in the ointment” in what could have been a relatively straightforward, albeit challenging, race for Rouhani to win a second term. Raisi’s rise to prominence over the past year has intrigued many commentators who speculate that he is being touted as a frontrunner to succeed Khamenei, a higher position than that of the president. </p>"}},{"type":"rich-link","assets":[],"richLinkTypeData":{"url":"https://www.theguardian.com/world/2017/apr/09/conservative-cleric-ebrahim-raisi-enters-irans-presidential-race","originalUrl":"https://www.theguardian.com/world/2017/apr/09/conservative-cleric-ebrahim-raisi-enters-irans-presidential-race","linkText":"Conservative cleric Ebrahim Raisi enters Iran's presidential race","linkPrefix":"Related: ","role":"thumbnail"}},{"type":"text","assets":[],"textTypeData":{"html":"<p>“I think definitely it has complicated the race,” Ansari said. “I think the fact that Raisi is coming, unless he steps aside, it looks very unlikely to me that the <em>nezam</em> [ruling system] would allow Raisi to be humiliated in an election. He hasn’t come to lose. He is an up-and-coming player in the system and in the last six months he’s basically come from nowhere.” </p> \n<p>There are also concerns about Rouhani’s possible disqualification. That explains why his first deputy, Eshaq Jahangiri, a figure close to the reformists, also registered to run on Saturday. “I’m here to supplement Rouhani,” he said, meaning that his bid for the presidency was tactical and that he would drop out if Rouhani is allowed to run.</p> \n<p>“Rouhani is not in as strong a position as we think he is, because he delivered the JCPOA [nuclear deal]. JCPOA in Iran is not seen as a giant triumph, and for me the problem is the way Rouhani sold it,” Ansari said. <br></p> \n<p>“He has stablised the economy, but I think he made a number of very exaggerated claims, and he is now paying the price in the popular mood. But in an open election I think people would vote for Rouhani . Rouhani is the best of a bad choice, but at the same time I don’t think he’s as clear a winner as some people in the west would like to think.”</p> \n<p>Although women have registered, all female nominees have previously been blocked from running. Azam Talaghani, a former MP and the daughter of a prominent revolutionary ayatollah, is among the women who have put their names on the list to test whether the authorities would allow women to run.</p>"}}]}],"totalBodyBlocks":1},"isHosted":false,"pillarId":"pillar/news","pillarName":"News"}}}