{"response":{"status":"ok","userTier":"developer","total":1,"content":{"id":"world/2017/apr/16/north-korea-donald-trump-china-south-korea","type":"article","sectionId":"world","sectionName":"World news","webPublicationDate":"2017-04-16T16:30:43Z","webTitle":"US officials warn tensions with North Korea are 'coming to a head'","webUrl":"https://www.theguardian.com/world/2017/apr/16/north-korea-donald-trump-china-south-korea","apiUrl":"https://content.guardianapis.com/world/2017/apr/16/north-korea-donald-trump-china-south-korea","blocks":{"body":[{"id":"58f375ede4b0e0ec04f0174e","bodyHtml":"<p>Donald Trump and senior officials said on Sunday the US would consider any lever – diplomatic, economic or military – to forestall North Korea’s nuclear ambitions, a day after the vice-president arrived in the area and the isolated nation <a href=\"https://www.theguardian.com/world/2017/apr/16/north-korea-missile-launch-attempt-says-south-korea-kim-jong-un\">launched a missile test that failed</a>.<br></p> <p>The president and his national security adviser, HR McMaster, said they first hoped that China would act on its neighbor, which depends on Beijing to prop up its trade and finances. Trump said he had backtracked on a campaign promise to immediately denounce China, in order to push the country on North Korea.</p> <aside class=\"element element-rich-link element--thumbnail\"> <p> <span>Related: </span><a href=\"https://www.theguardian.com/world/2017/apr/16/north-korea-missile-test-donald-trump-kim-jong-un-has-nothing-to-lose\">Trump's North Korea sabre-rattling has a flaw: Kim Jong-un has nothing to lose</a> </p> </aside>  <p>“Why would I call China a currency manipulator when they are working with us on the North Korean problem?” he wrote on Twitter from his resort in south Florida. “We will see what happens!”</p> <p>McMaster also hailed the president’s new relationship with his Chinese counterpart, Xi Jinping, whom he hosted in Florida earlier this month.</p> <p>“The consensus with the president, our key allies in the regions – Japan and South Korea in particular, but also the Chinese leadership – is that this problem is coming to a head,” McMaster told ABC’s This Week, speaking from Afghanistan. </p> <p>“It’s time for us to undertake all actions we can, short of a military option, to try to resolve this peacefully.”</p> <p>Each missile and atomic bomb test – officials had feared a sixth nuclear test over the weekend – represented steady progress for dictator Kim Jong-un, McMaster said, whether or not a given test was deemed successful by his regime. The adviser refused to rule out overt or covert military action to stop what he called “a grave threat to all people”.</p> <p>“This is a situation that just can’t continue,” McMaster said. “The president’s made very clear that he is not in the business of announcing in advance exactly what he’s going to do in any particular situation.”</p> <p>McMaster held out hope that Beijing could exert economic pressure on Pyongyang. He said Trump and Xi had cultivated a “warm relationship” and that the Chinese leader was “courageous” to abstain from siding with Russia in the United Nations this week. China had <a href=\"http://www.reuters.com/article/us-mideast-crisis-syria-un-vote-idUSKBN17E2LK\">previously joined Russia</a> in voting against resolutions to denounce the actions of Syria’s government in its civil war.</p> <p>During their meeting, Xi briefly told Trump about the deep ties and complicated history between China and North Korea, Trump told <a href=\"https://blogs.wsj.com/washwire/2017/04/12/wsj-trump-interview-excerpts-china-north-korea-ex-im-bank-obamacare-bannon/\">the Wall Street Journal</a> this week. </p> <p>“After listening for 10 minutes I realized that not – it’s not so easy,” Trump said, expressing surprise at the pressures of trade and migration along the Chinese-North Korean border. “A lot of goods come in. But it’s not what you would think.”</p> <p>A few days after that meeting, though, Trump said he would be willing to act alone. “If China decides to help, that would be great,” he <a href=\"https://twitter.com/realDonaldTrump/status/851767718248361986\">tweeted</a>. “If not, we will solve the problem without them!”</p>       <figure class=\"element element-video\" data-canonical-url=\"https://www.theguardian.com/world/video/2017/apr/15/north-korea-military-parade-shows-off-new-weapons-video\"            data-short-url=\"https://gu.com/p/6a3pv\"                    data-show-ads=\"true\"            data-video-id=\"3388338\"            data-video-name=\"North Korea military parade shows off  ‘new weapons’ – video\"            data-video-provider=\"Reuters\"            > <video data-media-id=\"gu-video-58f1e1b0e4b05776df18dd88\" class=\"gu-video\" controls=\"controls\" poster=\"\"> <source src=\"https://cdn.theguardian.tv/mainwebsite/2017/04/15/170415nkorea_desk.mp4\"/><source src=\"https://cdn.theguardian.tv/HLS/2017/04/15/170415nkorea.m3u8\"/><source src=\"https://cdn.theguardian.tv/webM/2017/04/15/170415nkorea_WebM.webm\"/> </video> <figcaption><a href=\"https://www.theguardian.com/world/video/2017/apr/15/north-korea-military-parade-shows-off-new-weapons-video\">North Korea military parade shows off ‘new weapons’</a></figcaption> </figure>   <p>American defense and intelligence officials have refused to say whether the US, possibly through a covert cyber-attack, played a role in causing the North Korean missile to explode after its test launch. On Sunday, the deputy national security adviser, KT McFarland, told Fox News Sunday she could not say whether <a href=\"https://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html?_r=0\">a cyber campaign</a> begun by Barack Obama’s administration had continued.</p> <p>“You know we can’t talk about that,” she said.</p> <p>On Saturday, the US defense secretary, Jim Mattis, delivered an unusually curt statement on the launch. “The president and his military team are aware of North Korea’s most recent unsuccessful missile launch,” he said. “The president has no further comment.”</p> <p>In Seoul, Mike Pence made more familiar remarks promising support for its allies in the Pacific. Speaking at an Easter dinner on a military base, the US vice-president called the test a “provocation” and promised US support for South Korea. </p> <p>“Our commitment to this historic alliance with the courageous people of South Korea has never been stronger,” Pence said. During his presidential campaign, Trump wavered on this assurance and <a href=\"http://www.politifact.com/truth-o-meter/statements/2016/nov/14/donald-trump/donald-trump-wrongly-tweets-he-never-said-more-cou/\">suggested</a> that Japan and South Korea should perhaps defend themselves. </p> <aside class=\"element element-rich-link element--thumbnail\"> <p> <span>Related: </span><a href=\"https://www.theguardian.com/us-news/2017/apr/16/donald-trump-america-first-foreign-policy-syria-china-russia\">As Trump plays the global strongman, what happened to 'America first'?</a> </p> </aside>  <p>Only about 35 miles from the demilitarized zone, Seoul stands within range of North Korean artillery, a detail noted by American lawmakers on Sunday as they argued for urgent diplomacy and sanctions. Nearly 30,000 American service members are stationed in South Korea, and the US sent an aircraft carrier toward the peninsula last week.</p> <p>John McCain told NBC’s Meet the Press that China was “the key” to preventing “what could be a cataclysmic event”. </p> <p>“They can stop this if the want to because of their control over the North Korean economy,” the Republican senator said. </p> <p>Bernie Sanders similarly told CNN’s State of the Union that partners in Asia must act in tandem, saying: “The United States must not act impulsively and we must not act unilaterally.”</p> <p>Sanders and Ed Royce, the chairman of the House foreign affairs committee, argued for more sanctions. Royce specifically urged the president to impose sanctions on 10 Chinese banks, to choke funding for North Korea’s missile program.</p> <p>“We are looking at shutting off every dime of money that goes in there,” Royce told CNN.</p> <p>Chinese diplomats have grown increasingly frustrated with Kim’s regime, and in February Beijing <a href=\"http://www.cnn.com/2017/02/19/asia/china-coal-north-korea-ban/\">banned</a> North Korean coal imports, a major source of income. In January, China said it would comply with new UN sanctions. Even so, trade between the nations has increased since last year: North Korea does 80-90% of its trade with China.</p> <p>North Korean officials did not comment on the failed missile launch. On Saturday, Kim celebrated the 105th anniversary of his grandfather’s birth, a holiday called the Day of the Sun. From a raised platform, Kim watched soldiers march and wheel out a large, camouflage-painted missile that was put on display for the foreign press. </p> <p>McMaster said the propaganda was disturbing, even though it was not clear whether the missile was genuine or a shell for show.</p>","bodyTextSummary":"Donald Trump and senior officials said on Sunday the US would consider any lever – diplomatic, economic or military – to forestall North Korea’s nuclear ambitions, a day after the vice-president arrived in the area and the isolated nation launched a missile test that failed. The president and his national security adviser, HR McMaster, said they first hoped that China would act on its neighbor, which depends on Beijing to prop up its trade and finances. Trump said he had backtracked on a campaign promise to immediately denounce China, in order to push the country on North Korea.\n“Why would I call China a currency manipulator when they are working with us on the North Korean problem?” he wrote on Twitter from his resort in south Florida. “We will see what happens!” McMaster also hailed the president’s new relationship with his Chinese counterpart, Xi Jinping, whom he hosted in Florida earlier this month. “The consensus with the president, our key allies in the regions – Japan and South Korea in particular, but also the Chinese leadership – is that this problem is coming to a head,” McMaster told ABC’s This Week, speaking from Afghanistan. “It’s time for us to undertake all actions we can, short of a military option, to try to resolve this peacefully.” Each missile and atomic bomb test – officials had feared a sixth nuclear test over the weekend – represented steady progress for dictator Kim Jong-un, McMaster said, whether or not a given test was deemed successful by his regime. The adviser refused to rule out overt or covert military action to stop what he called “a grave threat to all people”. “This is a situation that just can’t continue,” McMaster said. “The president’s made very clear that he is not in the business of announcing in advance exactly what he’s going to do in any particular situation.” McMaster held out hope that Beijing could exert economic pressure on Pyongyang. He said Trump and Xi had cultivated a “warm relationship” and that the Chinese leader was “courageous” to abstain from siding with Russia in the United Nations this week. China had previously joined Russia in voting against resolutions to denounce the actions of Syria’s government in its civil war. During their meeting, Xi briefly told Trump about the deep ties and complicated history between China and North Korea, Trump told the Wall Street Journal this week. “After listening for 10 minutes I realized that not – it’s not so easy,” Trump said, expressing surprise at the pressures of trade and migration along the Chinese-North Korean border. “A lot of goods come in. But it’s not what you would think.” A few days after that meeting, though, Trump said he would be willing to act alone. “If China decides to help, that would be great,” he tweeted. “If not, we will solve the problem without them!”\nAmerican defense and intelligence officials have refused to say whether the US, possibly through a covert cyber-attack, played a role in causing the North Korean missile to explode after its test launch. On Sunday, the deputy national security adviser, KT McFarland, told Fox News Sunday she could not say whether a cyber campaign begun by Barack Obama’s administration had continued. “You know we can’t talk about that,” she said. On Saturday, the US defense secretary, Jim Mattis, delivered an unusually curt statement on the launch. “The president and his military team are aware of North Korea’s most recent unsuccessful missile launch,” he said. “The president has no further comment.” In Seoul, Mike Pence made more familiar remarks promising support for its allies in the Pacific. Speaking at an Easter dinner on a military base, the US vice-president called the test a “provocation” and promised US support for South Korea. “Our commitment to this historic alliance with the courageous people of South Korea has never been stronger,” Pence said. During his presidential campaign, Trump wavered on this assurance and suggested that Japan and South Korea should perhaps defend themselves.\nOnly about 35 miles from the demilitarized zone, Seoul stands within range of North Korean artillery, a detail noted by American lawmakers on Sunday as they argued for urgent diplomacy and sanctions. Nearly 30,000 American service members are stationed in South Korea, and the US sent an aircraft carrier toward the peninsula last week. John McCain told NBC’s Meet the Press that China was “the key” to preventing “what could be a cataclysmic event”. “They can stop this if the want to because of their control over the North Korean economy,” the Republican senator said. Bernie Sanders similarly told CNN’s State of the Union that partners in Asia must act in tandem, saying: “The United States must not act impulsively and we must not act unilaterally.” Sanders and Ed Royce, the chairman of the House foreign affairs committee, argued for more sanctions. Royce specifically urged the president to impose sanctions on 10 Chinese banks, to choke funding for North Korea’s missile program. “We are looking at shutting off every dime of money that goes in there,” Royce told CNN. Chinese diplomats have grown increasingly frustrated with Kim’s regime, and in February Beijing banned North Korean coal imports, a major source of income. In January, China said it would comply with new UN sanctions. Even so, trade between the nations has increased since last year: North Korea does 80-90% of its trade with China. North Korean officials did not comment on the failed missile launch. On Saturday, Kim celebrated the 105th anniversary of his grandfather’s birth, a holiday called the Day of the Sun. From a raised platform, Kim watched soldiers march and wheel out a large, camouflage-painted missile that was put on display for the foreign press. McMaster said the propaganda was disturbing, even though it was not clear whether the missile was genuine or a shell for show.","attributes":{},"published":true,"createdDate":"2017-04-16T13:47:25Z","firstPublishedDate":"2017-04-16T13:47:31Z","publishedDate":"2017-04-16T21:59:05Z","lastModifiedDate":"2017-04-16T21:59:04Z","contributors":[],"elements":[{"type":"text","assets":[],"textTypeData":{"html":"<p>Donald Trump and senior officials said on Sunday the US would consider any lever – diplomatic, economic or military – to forestall North Korea’s nuclear ambitions, a day after the vice-president arrived in the area and the isolated nation <a href=\"https://www.theguardian.com/world/2017/apr/16/north-korea-missile-launch-attempt-says-south-korea-kim-jong-un\">launched a missile test that failed</a>.<br></p> \n<p>The president and his national security adviser, HR McMaster, said they first hoped that China would act on its neighbor, which depends on Beijing to prop up its trade and finances. Trump said he had backtracked on a campaign promise to immediately denounce China, in order to push the country on North Korea.</p>"}},{"type":"rich-link","assets":[],"richLinkTypeData":{"url":"https://www.theguardian.com/world/2017/apr/16/north-korea-missile-test-donald-trump-kim-jong-un-has-nothing-to-lose","originalUrl":"https://www.theguardian.com/world/2017/apr/16/north-korea-missile-test-donald-trump-kim-jong-un-has-nothing-to-lose","linkText":"Trump's North Korea sabre-rattling has a flaw: Kim Jong-un has nothing to lose","linkPrefix":"Related: ","role":"thumbnail"}},{"type":"text","assets":[],"textTypeData":{"html":"<p>“Why would I call China a currency manipulator when they are working with us on the North Korean problem?” he wrote on Twitter from his resort in south Florida. “We will see what happens!”</p> \n<p>McMaster also hailed the president’s new relationship with his Chinese counterpart, Xi Jinping, whom he hosted in Florida earlier this month.</p> \n<p>“The consensus with the president, our key allies in the regions – Japan and South Korea in particular, but also the Chinese leadership – is that this problem is coming to a head,” McMaster told ABC’s This Week, speaking from Afghanistan. </p> \n<p>“It’s time for us to undertake all actions we can, short of a military option, to try to resolve this peacefully.”</p> \n<p>Each missile and atomic bomb test – officials had feared a sixth nuclear test over the weekend – represented steady progress for dictator Kim Jong-un, McMaster said, whether or not a given test was deemed successful by his regime. The adviser refused to rule out overt or covert military action to stop what he called “a grave threat to all people”.</p> \n<p>“This is a situation that just can’t continue,” McMaster said. “The president’s made very clear that he is not in the business of announcing in advance exactly what he’s going to do in any particular situation.”</p> \n<p>McMaster held out hope that Beijing could exert economic pressure on Pyongyang. He said Trump and Xi had cultivated a “warm relationship” and that the Chinese leader was “courageous” to abstain from siding with Russia in the United Nations this week. China had <a href=\"http://www.reuters.com/article/us-mideast-crisis-syria-un-vote-idUSKBN17E2LK\">previously joined Russia</a> in voting against resolutions to denounce the actions of Syria’s government in its civil war.</p> \n<p>During their meeting, Xi briefly told Trump about the deep ties and complicated history between China and North Korea, Trump told <a href=\"https://blogs.wsj.com/washwire/2017/04/12/wsj-trump-interview-excerpts-china-north-korea-ex-im-bank-obamacare-bannon/\">the Wall Street Journal</a> this week. </p> \n<p>“After listening for 10 minutes I realized that not – it’s not so easy,” Trump said, expressing surprise at the pressures of trade and migration along the Chinese-North Korean border. “A lot of goods come in. But it’s not what you would think.”</p> \n<p>A few days after that meeting, though, Trump said he would be willing to act alone. “If China decides to help, that would be great,” he <a href=\"https://twitter.com/realDonaldTrump/status/851767718248361986\">tweeted</a>. “If not, we will solve the problem without them!”</p>"}},{"type":"video","assets":[{"type":"video","mimeType":"video/m3u8","file":"https://cdn.theguardian.tv/HLS/2017/04/15/170415nkorea.m3u8","typeData":{"isInappropriateForAdverts":false,"embeddable":false,"source":"Reuters","width":1920,"height":1080}},{"type":"video","mimeType":"video/webm","file":"https://cdn.theguardian.tv/webM/2017/04/15/170415nkorea_WebM.webm","typeData":{"isInappropriateForAdverts":false,"embeddable":false,"source":"Reuters","width":1920,"height":1080}},{"type":"video","mimeType":"video/mp4","file":"https://cdn.theguardian.tv/mainwebsite/2017/04/15/170415nkorea_desk.mp4","typeData":{"isInappropriateForAdverts":false,"embeddable":false,"source":"Reuters","width":1920,"height":1080}},{"type":"image","mimeType":"image/jpeg","file":"https://media.guim.co.uk/e2578976457a673b2c68f72d7c41d08cb453d305/0_480_5242_2949/140.jpg","typeData":{"width":140,"height":79}},{"type":"image","mimeType":"image/jpeg","file":"https://media.guim.co.uk/e2578976457a673b2c68f72d7c41d08cb453d305/0_480_5242_2949/500.jpg","typeData":{"width":500,"height":281}},{"type":"image","mimeType":"image/jpeg","file":"https://media.guim.co.uk/e2578976457a673b2c68f72d7c41d08cb453d305/0_480_5242_2949/1000.jpg","typeData":{"width":1000,"height":563}},{"type":"image","mimeType":"image/jpeg","file":"https://media.guim.co.uk/e2578976457a673b2c68f72d7c41d08cb453d305/0_480_5242_2949/2000.jpg","typeData":{"width":2000,"height":1125}},{"type":"image","mimeType":"image/jpeg","file":"https://media.guim.co.uk/e2578976457a673b2c68f72d7c41d08cb453d305/0_480_5242_2949/5242.jpg","typeData":{"width":5242,"height":2949}},{"type":"image","mimeType":"image/jpeg","file":"http://media.guim.co.uk/e2578976457a673b2c68f72d7c41d08cb453d305/0_480_5242_2949/master/5242.jpg","typeData":{"width":5242,"height":2949}}],"videoTypeData":{"url":"https://www.theguardian.com/world/video/2017/apr/15/north-korea-military-parade-shows-off-new-weapons-video","description":"<p>North Korean leader Kim Jong-un watches a military parade in Pyongyang on Saturday, marking the 105th ‘Day of the Sun’, the birth anniversary of the state’s founder Kim Il-sung. The parade showcases military vehicles carrying different types of missiles. International fears have been mounting over whether the regime is preparing to conduct a nuclear test</p><ul><li><a href=\"https://www.theguardian.com/world/2017/apr/15/north-korea-nuclear-test-miltary-parade-kim-il-sung\">North Korea parades military might and warns US amid nuclear test fears</a><br></li></ul>","title":"North Korea military parade shows off  ‘new weapons’ – video","html":"<video data-media-id=\"gu-video-58f1e1b0e4b05776df18dd88\" class=\"gu-video\" controls=\"controls\" poster=\"\"> <source src=\"https://cdn.theguardian.tv/mainwebsite/2017/04/15/170415nkorea_desk.mp4\"/><source src=\"https://cdn.theguardian.tv/HLS/2017/04/15/170415nkorea.m3u8\"/><source src=\"https://cdn.theguardian.tv/webM/2017/04/15/170415nkorea_WebM.webm\"/> </video>","source":"Guardian","caption":"<a href=\"https://www.theguardian.com/world/video/2017/apr/15/north-korea-military-parade-shows-off-new-weapons-video\">North Korea military parade shows off ‘new weapons’</a>","duration":55,"isInappropriateForAdverts":false,"mediaId":"gu-video-58f1e1b0e4b05776df18dd88","shortUrl":"https://gu.com/p/6a3pv","originalUrl":"https://www.theguardian.com/world/video/2017/apr/15/north-korea-military-parade-shows-off-new-weapons-video"}},{"type":"text","assets":[],"textTypeData":{"html":"<p>American defense and intelligence officials have refused to say whether the US, possibly through a covert cyber-attack, played a role in causing the North Korean missile to explode after its test launch. On Sunday, the deputy national security adviser, KT McFarland, told Fox News Sunday she could not say whether <a href=\"https://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html?_r=0\">a cyber campaign</a> begun by Barack Obama’s administration had continued.</p> \n<p>“You know we can’t talk about that,” she said.</p> \n<p>On Saturday, the US defense secretary, Jim Mattis, delivered an unusually curt statement on the launch. “The president and his military team are aware of North Korea’s most recent unsuccessful missile launch,” he said. “The president has no further comment.”</p> \n<p>In Seoul, Mike Pence made more familiar remarks promising support for its allies in the Pacific. Speaking at an Easter dinner on a military base, the US vice-president called the test a “provocation” and promised US support for South Korea. </p> \n<p>“Our commitment to this historic alliance with the courageous people of South Korea has never been stronger,” Pence said. During his presidential campaign, Trump wavered on this assurance and <a href=\"http://www.politifact.com/truth-o-meter/statements/2016/nov/14/donald-trump/donald-trump-wrongly-tweets-he-never-said-more-cou/\">suggested</a> that Japan and South Korea should perhaps defend themselves. </p>"}},{"type":"rich-link","assets":[],"richLinkTypeData":{"url":"https://www.theguardian.com/us-news/2017/apr/16/donald-trump-america-first-foreign-policy-syria-china-russia","originalUrl":"https://www.theguardian.com/us-news/2017/apr/16/donald-trump-america-first-foreign-policy-syria-china-russia","linkText":"As Trump plays the global strongman, what happened to 'America first'?","linkPrefix":"Related: ","role":"thumbnail"}},{"type":"text","assets":[],"textTypeData":{"html":"<p>Only about 35 miles from the demilitarized zone, Seoul stands within range of North Korean artillery, a detail noted by American lawmakers on Sunday as they argued for urgent diplomacy and sanctions. Nearly 30,000 American service members are stationed in South Korea, and the US sent an aircraft carrier toward the peninsula last week.</p> \n<p>John McCain told NBC’s Meet the Press that China was “the key” to preventing “what could be a cataclysmic event”. </p> \n<p>“They can stop this if the want to because of their control over the North Korean economy,” the Republican senator said. </p> \n<p>Bernie Sanders similarly told CNN’s State of the Union that partners in Asia must act in tandem, saying: “The United States must not act impulsively and we must not act unilaterally.”</p> \n<p>Sanders and Ed Royce, the chairman of the House foreign affairs committee, argued for more sanctions. Royce specifically urged the president to impose sanctions on 10 Chinese banks, to choke funding for North Korea’s missile program.</p> \n<p>“We are looking at shutting off every dime of money that goes in there,” Royce told CNN.</p> \n<p>Chinese diplomats have grown increasingly frustrated with Kim’s regime, and in February Beijing <a href=\"http://www.cnn.com/2017/02/19/asia/china-coal-north-korea-ban/\">banned</a> North Korean coal imports, a major source of income. In January, China said it would comply with new UN sanctions. Even so, trade between the nations has increased since last year: North Korea does 80-90% of its trade with China.</p> \n<p>North Korean officials did not comment on the failed missile launch. On Saturday, Kim celebrated the 105th anniversary of his grandfather’s birth, a holiday called the Day of the Sun. From a raised platform, Kim watched soldiers march and wheel out a large, camouflage-painted missile that was put on display for the foreign press. </p> \n<p>McMaster said the propaganda was disturbing, even though it was not clear whether the missile was genuine or a shell for show.</p>"}}]}],"totalBodyBlocks":1},"isHosted":false,"pillarId":"pillar/news","pillarName":"News"}}}